<template>

    <div v-if="show" class="so-pop-wanfa modal publicDialog">
        <div class="m_content">
            <h2>{{moduleName || '香港六合彩'}}玩法说明<a @click="close"></a></h2>
            <div class="content">
                <div class="playtext">
                    <h3>一、开奖与结束时间</h3>
                    <p>{{moduleplay || '根据香港赛马协会公布日期，六合彩每星期搅珠三次，通常於星期二丶星期四及非赛马日之星期六或日晚上举行。'}}</p>
                    <h3>二、特码玩法</h3>
                    <h4>特码A、特码B</h4>
                    <p>香港六合彩公司当期开出的最後一码为特码。</p>
                    <h4>两面</h4>
                    <p>大：开出的特码25~48。</p>
                    <p>小：开出的特码01~24。</p>
                    <p>和局：号码为49。</p>
                    <p>单：特码为单数，如01，11，35，47。</p>
                    <p>双：特码为双数，如18，20，34，42。</p>
                    <p>和局：号码为49。</p>
                    <p>红波、蓝波、绿波：香港六合彩49个号码球分别有红、蓝、绿三种颜色，以特码开出的颜色和投注的颜色相同视为中奖。</p>
                    <h3>三、两面玩法</h3>
                    <h4>特码两面</h4>
                    <p>特大：开出的特码25~48。</p>
                    <p>特小：开出的特码01~24。</p>
                    <p>和局：号码为49。</p>
                    <p>特单：特码为单数，如01，11，35，47。</p>
                    <p>特双：特码为双数，如18，20，34，42。</p>
                    <p>和局：号码为49。</p>
                    <p>特合大：特码的个位加上十位之和来决定大小，和数大于或等于7为大。</p>
                    <p>特合小：特码的个位加上十位之和来决定大小，和数小于或等于6为小。</p>
                    <p>和局：号码为49。</p>
                    <p>特合单：指开出特码的个位加上十位之和为‘单数’，如01，14，36，47。</p>
                    <p>特合双：指开出特码的个位加上十位之和为‘双数’，如02，11，33，44。</p>
                    <p>和局：号码为49。</p>
                    <p>特天：指开出特码为属于天肖的号码，天肖：兔马猴猪牛龙。</p>
                    <p>特地：指开出特码为属于地肖的号码，地肖：蛇羊鸡狗鼠虎。</p>
                    <p>和局：号码为49。</p>
                    <p>特前：指开出的特码为属于前肖的号码，前肖：鼠牛虎兔龙蛇。</p>
                    <p>特后：指开出的特码为属于后肖的号码，后肖：马羊猴鸡猪狗。</p>
                    <p>和局：号码为49。</p>
                    <p>特家：指开出的特码为属于家禽生肖的号码，家肖：牛马羊鸡狗猪。</p>
                    <p>特野：指开出的特码为属于野兽生肖的号码，野肖：鼠虎兔龙蛇猴。</p>
                    <p>和局：号码为49。</p>
                    <p>特尾大：5尾~9尾为大，如05，18，19。</p>
                    <p>特尾小：0尾~4尾为小，如01，32，44。</p>
                    <p>和局：号码为49。</p>
                    <p>特大单：开出的特码属大与单；大，开出号码25~48；单数，如25，31，35，47。</p>
                    <p>特大双：开出的特码属大与双；大，开出号码25~48；双数，如28，30，34，42。</p>
                    <p>和局：号码为49。</p>
                    <p>特小单：开出的特码属小与单；小，开出号码01~24；单数，如01，11，13，19。</p>
                    <p>特小双：开出的特码属小与双；小，开出号码01~24；双数，如02，06，12，24。</p>
                    <p>和局：号码为49。</p>
                    <h4>总和</h4>
                    <p>总和大：所有七个开奖号码的分数总和大于或等于175。</p>
                    <p>总和小：所有七个开奖号码的分数总和小于或等于174。</p>
                    <p>总和单：所有七个开奖号码的分数总和是‘单数’，如分数总和是133、197。</p>
                    <p>总和双：所有七个开奖号码的分数总和是‘双数’，如分数总和是120、188。</p>
                    <h3>四、正码玩法</h3>
                    <h4>正码</h4>
                    <p>香港六合彩公司当其下注的正码与现场摇珠开出之正码其开奖号码相同，视为中奖。</p>
                    <h4>总和</h4>
                    <p>香港六合彩公司现场摇珠开出之六个正码开奖相加的总和大小单双，其下注状态与开奖状态相同，视为中奖。</p>
                    <p>总大：所有六个开奖号码的分数总和大于或等于150。</p>
                    <p>总小：所有六个开奖号码的分数总和小于或等于149。</p>
                    <p>总单：所有六个开奖号码的分数总和是‘单数’，如分数总和是133、197。</p>
                    <p>总双：所有六个开奖号码的分数总和是‘双数’，如分数总和是120、188。</p>
                    <h3>五、正码1-6玩法</h3>
                    <h4>正码一～正码六</h4>
                    <p>大：开出的号码25~48。</p>
                    <p>小：开出的号码01~24。</p>
                    <p>和局：号码为49。</p>
                    <p>单：开出的号码为单数，如01，11，35，47。</p>
                    <p>双：开出的号码为双数，如18，20，34，42。</p>
                    <p>和局：号码为49。</p>
                    <p>合大：个位加上十位之和来决定大小，和数大于或等于7为大。</p>
                    <p>合小：个位加上十位之和来决定大小，和数小于或等于6为小。</p>
                    <p>和局：号码为49。</p>
                    <p>合单：指开出个位加上十位之和为‘单数’，如01，14，36，47。</p>
                    <p>合双：指开出个位加上十位之和为‘双数’，如02，11，33，44。</p>
                    <p>和局：号码为49。</p>
                    <p>尾大：5尾~9尾为大，如05，18，19。</p>
                    <p>尾小：0尾~4尾为小，如01，32，44。</p>
                    <p>和局：号码为49。</p>
                    <p>香港六合彩49个号码球分别有红、蓝、绿三种颜色，以开出的颜色和投注的颜色相同视为中奖。</p>
                    <h3>六、正特玩法</h3>
                    <h4>正1特～正6特</h4>
                    <p>香港六合彩公司当其下注的正码与现场摇珠开出之正码其开奖号码相同，视为中奖。</p>
                    <h4>两面</h4>
                    <p>大：开出的号码25~48。</p>
                    <p>小：开出的号码01~24。</p>
                    <p>和局：号码为49。</p>
                    <p>单：开出的号码为单数，如01，11，35，47。</p>
                    <p>双：开出的号码为双数，如18，20，34，42。</p>
                    <p>和局：号码为49。</p>
                    <p>合大：个位加上十位之和来决定大小，和数大于或等于7为大。</p>
                    <p>合小：个位加上十位之和来决定大小，和数小于或等于6为小。</p>
                    <p>和局：号码为49。</p>
                    <p>合单：指开出个位加上十位之和为‘单数’，如01，14，36，47。</p>
                    <p>合双：指开出个位加上十位之和为‘双数’，如02，11，33，44。</p>
                    <p>和局：号码为49。</p>
                    <p>尾大：5尾~9尾为大，如05，18，19。</p>
                    <p>尾小：0尾~4尾为小，如01，32，44。</p>
                    <p>和局：号码为49。</p>
                    <p>红波、蓝波、绿波：香港六合彩49个号码球分别有红、蓝、绿三种颜色，以开出的颜色和投注的颜色相同视为中奖。</p>
                    <h3>七、连码玩法</h3>
                    <h4>三全中</h4>
                    <p>所投注的每三个号码为一组合，若三个号码都是开奖号码之正码，视为中奖，其余情形视为 不中奖。如06、07、08三个都是开奖号码之正码，视为中奖，如两个正码加上一个特别号 码视为不中奖。<p>
                    <h4>三中二</h4>
                    <p>所投注的每三个号码为一组合，若其中2个是开奖号码中的正码，即为三中二，视为中奖；若3个都是开奖号码中的正码，即为三中二之中三，其余情形视为不中奖，如06、07、08 为一组合，开奖号码中有06、07两个正码，没有08，即为三中二，按三中二赔付；如开奖 号码中有06、07、08三个正码，即为三中二之中三，按中三赔付；如出现1个或没有，视为不中奖 。<p>
                    <h4>二全中</h4>
                    <p>所投注的每二个号码为一组合，二个号码都是开奖号码之正码，视为中奖，其余情形视为不 中奖（含一个正码加一个特别号码之情形）。</p>
                    <h4>二中特</h4>
                    <p>所投注的每二个号码为一组合，二个号码都是开奖号码之正码，叫二中特之中二；若其中一 个是正码，一个是特别号码，叫二中特之中特；其余情形视为不中奖。</p>
                    <h4>特串</h4>
                    <p>所投注的每二个号码为一组合，其中一个是正码，一个是特别号码，视为中奖，其余情形视为不中奖（含二个号码都是正码之情形）。</p>
                    <h4>四全中</h4>
                    <p>选择投注号码每四个为一组，兑奖号为正码，如四个号码都在开奖号码的正码里面，视为中奖，其他情形都视为不中奖。</p>
                    <h3>八、色波玩法</h3>
                    <h4>特码色波</h4>
                    <p>香港六合彩49个号码球分别有红、蓝、绿三种颜色，以特码开出的颜色和投注的颜色相同视为中奖。</p>
                    <p>红波：01、02、07、08、12、13、18、19、23、24、29、30、34、35、40、45、46</p>
                    <p>蓝波：03、04、09、10、14、15、20、25、26、31、36、37、41、42、47、48</p>
                    <p>绿波：05、06、11、16、17、21、22、27、28、32、33、38、39、43、44、49</p>
                    <h4>7色波</h4>
                    <p>以开出的7个色波，那种颜色最多为中奖。 开出的6个正码各以1个色波计，特别号以1.5个色波计。而以下3种结果视为和局。</p>
                    <p>1： 6个正码开出3蓝3绿，而特别码是1.5红。</p>
                    <p>2： 6个正码开出3蓝3红，而特别码是1.5绿。</p>
                    <p>3： 6个正码开出3绿3红，而特别码是1.5蓝。</p>
                    <p>会员也可投注和局。</p>
                    <h4>红球</h4>
                    <p>以特码色波和特单，特双，特大，特小为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出49号，则视为和局；其余情形视为不中奖。</p>
                    <p>红大：29、30、34、35、40、45、46</p>
                    <p>红小：01、02、07、08、12、13、18、19、23、24</p>
                    <p>红单：01、07、13、19、23、29、35、45</p>
                    <p>红双：02、08、12、18、24、30、34、40、46</p>
                    <p>红合单：01、07、12、18、23、29、30、34、45</p>
                    <p>红合双：02、08、13、19、24、35、40、46</p>
                    <h4>蓝球</h4>
                    <p>以特码色波和特单，特双，特大，特小为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出49号，则视为和局；其余情形视为不中奖。</p>
                    <p>蓝大：25、26、31、36、37、41、42、47、48</p>
                    <p>蓝小：03、04、09、10、14、15、20</p>
                    <p>蓝单：03、09、15、25、31、37、41、47</p>
                    <p>蓝双：04、10、14、20、26、36、42、48</p>
                    <p>蓝合单：03、09、10、14、25、36、41、47</p>
                    <p>蓝合双：04、15、20、26、31、37、42、48</p>
                    <h4>绿球</h4>
                    <p>以特码色波和特单，特双，特大，特小为一个投注组合，当期特码开出符合投注组合，即视为中奖； 若当期特码开出49号，则视为和局；其余情形视为不中奖。</p>
                    <p>绿大：27、28、32、33、38、39、43、44</p>
                    <p>绿小：05、06、11、16、17、21、22</p>
                    <p>绿单：05、11、17、21、27、33、39、43</p>
                    <p>绿双：06、16、22、28、32、38、44</p>
                    <p>绿合单：05、16、21、27、32、38、43</p>
                    <p>绿合双：06、11、17、22、28、33、39、44</p>
                    <h3>九、特码头尾</h3>
                    <h4>特码头数</h4>
                    <p>是指特码属头数的号码。</p>
                    <p>0头：01、02、03、04、05、06、07、08、09</p>
                    <p>1头：10、11、12、13、14、15、16、17、18、19</p>
                    <p>2头：20、21、22、23、24、25、26、27、28、29</p>
                    <p>3头、30、31、32、33、34、35、36、37、38、39</p>
                    <p>4头：40、41、42、43、44、45、46、47、48、49</p>
                    <p>例如：开奖结果特别号码为21则2头为中奖，其他头数都不中奖。</p>
                    <h4>特码尾数</h4>
                    <p>是指特码属尾数的号码。</p>
                    <p>0尾：10、20、30、40</p>
                    <p>1尾：01、11、21、31、41</p>
                    <p>2尾：02、12、22、32、42</p>
                    <p>3尾：03、13、23、33、43</p>
                    <p>4尾：04、14、24、34、44</p>
                    <p>5尾：05、15、25、35、45</p>
                    <p>6尾：06、16、26、36、46</p>
                    <p>7尾：07、17、27、37、47</p>
                    <p>8尾：08、18、28、38、48</p>
                    <p>9尾：09、19、29、39、49</p>
                    <p>例如：开奖结果特别号码为21则1尾数为中奖，其他尾数都不中奖。</p>
                    <h3>十、总肖玩法</h3>
                    <h4>2肖-7肖</h4>
                    <p>当期号码(所有正码与最後开出的特码)开出的不同生肖总数，与所投注之预计开出之生肖总数合(不用指定特定生肖)，则视为中奖，其余情形视为不中奖。例如：如果当期号码为19、24、12、34、40、39 特别号：49，总计六个生肖，若选总肖【6】则为中奖(请注意：49号亦算输赢，不为和）。<p>
                    <h4>总肖单双</h4>
                    <p>当期号码（正码和特码）开出的不同生肖总数若为单数则为单，若为双数则为双。</p>
                    <h3>十一、平特肖尾玩法</h3>
                    <h4>一肖</h4>
                    <p>指开奖的7个号码中含有所属生肖的一个或多个号码，但派彩只派一次，即不论同生肖号码出现一个或多个号码都只派一次。</p>
                    <p>※以狗年为本命年作为范例</p>
                    <p>鼠：11、23、35、47</p>
                    <p>牛：10、22、34、46</p>
                    <p>虎：09、21、33、45</p>
                    <p>兔：08、20、32、44</p>
                    <p>龙：07、19、31、43</p>
                    <p>蛇：06、18、30、42</p>
                    <p>马：05、17、29、41</p>
                    <p>羊：04、16、28、40</p>
                    <p>猴：03、15、27、39</p>
                    <p>鸡：02、14、26、38</p>
                    <p>狗：01、13、25、37、49</p>
                    <p>猪：12、24、36、48</p>
                    <h4>尾数</h4>
                    <p>指开奖的7个号码中含有所属尾数的一个或多个号码，但派彩只派一次，即不论同尾数号码出现一个或多个号码都只派一次。</p>
                    <p>0尾：10、20、30、40</p>
                    <p>1尾：01、11、21、31、41</p>
                    <p>2尾：02、12、22、32、42</p>
                    <p>3尾：03、13、23、33、43</p>
                    <p>4尾：04、14、24、34、44</p>
                    <p>5尾：05、15、25、35、45</p>
                    <p>6尾：06、16、26、36、46</p>
                    <p>7尾：07、17、27、37、47</p>
                    <p>8尾：08、18、28、38、48</p>
                    <p>9尾：09、19、29、39、49</p>
                    <h3>十二、特肖玩法</h3>
                    <p>生肖顺序为 鼠 >牛 >虎 >兔 >龙 >蛇 >马 >羊 >猴 >鸡 >狗 >猪 。<p>
                    <p>若当期特别号，落在下注生肖范围内，视为中奖 。</p>
                    <h3>十三、连肖玩法</h3>
                    <h4>二连肖</h4>
                    <p>选择二个生肖为一投注组合进行下注。该注的二个生肖必须在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                    <h4>三连肖</h4>
                    <p>选择三个生肖为一投注组合进行下注。该注的三个生肖必须在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                    <h4>四连肖</h4>
                    <p>选择四个生肖为一投注组合进行下注。该注的四个生肖必须在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                    <h4>五连肖</h4>
                    <p>选择五个生肖为一投注组合进行下注。该注的五个生肖必须在当期开出的7个开奖号码相对应的生肖中，视为中奖。</p>
                    <h3>十四、合肖玩法</h3>
                    <p>挑选2-11个生肖『排列如同生肖』为一个组合，并选择开奖号码的特码是否在此组合内『49号除外』，即视为中奖；若当期特码开出49号，则所有组合皆视为和局。</p>
                    <h3>十五、连尾玩法</h3>
                    <p>0尾：10、20、30、40</p>
                    <p>1尾：01、11、21、31、41</p>
                    <p>2尾：02、12、22、32、42</p>
                    <p>3尾：03、13、23、33、43</p>
                    <p>4尾：04、14、24、34、44</p>
                    <p>5尾：05、15、25、35、45</p>
                    <p>6尾：06、16、26、36、46</p>
                    <p>7尾：07、17、27、37、47</p>
                    <p>8尾：08、18、28、38、48</p>
                    <p>9尾：09、19、29、39、49</p>
                    <h4>二连尾</h4>
                    <p>选择二个尾数为一投注组合进行下注。该注的二个尾数必须在当期开出的7个开奖号码相对应的尾数中，视为中奖。</p>
                    <h4>三连尾</h4>
                    <p>选择三个尾数为一投注组合进行下注。该注的三个尾数必须在当期开出的7个开奖号码相对应的尾数中，视为中奖。</p>
                    <h4>四连尾:</h4>
                    <p>选择四个尾数为一投注组合进行下注。该注的四个尾数必须在当期开出的7个开奖号码相对应的尾数中，视为中奖。</p>
                    <h4>五连尾</h4>
                    <p>选择五个尾数为一投注组合进行下注。该注的五个尾数必须在当期开出的7个开奖号码相对应的尾数中，视为中奖。</p>
                    <h3>十六、正肖玩法</h3>
                    <p>以开出的6个正码做游戏，只要有1个落在下注生肖范围内，视为中奖。如超过1个正码落在下注生肖范围内 ，派彩将倍增！例如：正肖倍率1.8，下注＄100。</p>
                    <p>6个正码开出01，派彩为＄80</p>
                    <p>6个正码开出01，13，派彩为＄160</p>
                    <p>6个正码开出01，13，25，派彩为＄240</p>
                    <p>6个正码开出01，13，25，37，派彩为＄320</p>
                    <p>6个正码开出01，13，25，37，49，派彩为＄320</p>
                    <h3>十七、特码五行玩法</h3>
                    <p>挑选一个五行选项为一个组合，若开奖号码的特码在此组合内，即视为中奖；若开奖号码的特码亦不在此组合内，即视为不中奖。</p>
                    <p>金：猴、鸡</p>
                    <p>木：虎、兔5</p>
                    <p>水：鼠、猪</p>
                    <p>火：蛇、马</p>
                    <p>土：牛、龙、羊、狗</p>
                    <h3>十八、自选不中玩法</h3>
                    <p>挑选最少5个号码为一投注组合进行下注。当期开出的7个开奖号码都没有在该下注组合中，即视为中奖。每个号码都有自己的赔率，下注组合的总赔率，取该组合号码的最低赔率为总赔率。如下注组合为1-2-3-4-5，开奖号码为6，7，8，9，10，11，12，即为中奖，如果开奖号码为5，6，7，8，9，10，11，那麽为不中奖。</p>
                </div>
            </div>
            <div class="action">
                <a class="new_btn ok" @click="close"><span>确定</span></a>
            </div>
        </div>
    </div>

</template>


<script>
    export default {
        name: 'InfoDialog',
        props:['moduleName', 'moduleplay'],
        methods:{
            //打开弹窗
            open(e) {
                this.show = true;
            },
            //关闭弹窗
            close(e) {
                this.show = false;
            }
        },
        //程序加载完闭时
        mounted() {
        },
        data () {
            return {
                show: false
            }
        }
    }
</script>
<style scope>
    .publicDialog { display: block !important; }
</style>
