<template>
    <div v-if="show" class="so-pop-wanfa modal publicDialog">
        <div class="m_content">
            <h2>{{moduleName || '幸运28'}}游戏玩法<a @click="close"></a></h2>
            <div class="content">
                <div class="playtext">
                    <h3>一、开奖与结束时间</h3>
                    <p>每日09：05-23：55，每 5 分钟开一次奖，全天开奖 179 期。</p>
                    <h3>二、玩法说明</h3>
                    <p>幸运28将北京快乐8 开奖结果20个号码按照从小到大的顺序依次排列；</p>
                    <p>取其1~6位开奖号码相加，和值的个位数作为 幸运28 开奖第一个数值；</p>
                    <p>取其7~12位开奖号码相加，和值的个位数作为 幸运28 开奖第二个数值；</p>
                    <p>取其13~18位开奖号码相加，和值的个位数作为 幸运28 开奖第三个数值；</p>
                    <p>得到的三个数值相加之和为 幸运28 最终的开奖结果，也叫特码。例如：北京快乐8 第 773388 期 开奖结果为：03,05,09,16,17,20,26,38,43,46,47,50,51,53,65,70,71,76,79,80</p>
                    <p>则 幸运28 第 773388 期的开奖结果计算公式如下：</p>
                    <p>第一个数值：3+5+9+16+17+20=70 取个位 0</p>
                    <p>第二个数值：26+38+43+46+47+50=250 取个位 0</p>
                    <p>第三个数值：51+53+65+70+71+76=386 取个位 6</p>
                    <p>最终开奖结果为：0 + 0 + 6 = 6</p>
                    <h4>混合</h4>
                    <p>大：14,15,16,17,18,19,20,21,22,23,24,25,26,27</p>
                    <p>小：0,1,2,3,4,5,6,7,8,9,10,11,12,13</p>
                    <p>如：特码开出号码：26，投注 特码-大 则中奖，否则不中奖。</p>
                    <p>单：1,3,5,7,9,11,13,15,17,19,21,23,25,27</p>
                    <p>双：0,2,4,6,8,10,12,14,16,18,20,22,24,26</p>
                    <p>如：特码开出号码：26，投注 特码-双 则中奖，否则不中奖。</p>
                    <p>极大：22,23,24,25,26,27</p>
                    <p>极小：0,1,2,3,4,5</p>
                    <p>如：特码开出号码：26，投注 特码-极大 则中奖，其它不中奖。</p>
                    <p>注：如开奖特码为：8，因不在极值范围内，投注 极大、极小 皆不中奖</p>
                    <p>豹子：由北京快乐8所开出的3个数字一样即为豹子，请注意此处不是对特码和值的投注，例如（1,1,1）、（2,2,2）</p>
                    <p>如：开出3个数字为3,3,3 ，特码为9，投注豹子则中奖</p>
                    <p>绿波：01,04,07,10,16,19,22,25</p>
                    <p>蓝波：02,05,08,11,17,20,23,26</p>
                    <p>红波：03,06,09,12,15,18,21,24</p>
                    <p>如：特码开出号码：26，投注 特码-蓝波 则中奖，其它不中奖。</p>
                    <p>注：开奖特码为：0,13,14,27，因不在波色范围内，投注 波色 皆不中奖。</p>
                    <h4>特码和值</h4>
                    <p>0-27：对特码数字进行投注，如若一样则中奖。</p>
                    <p>如：特码开出号码：26，投注 26 则中奖，其它不中奖。</p>
                </div>
            </div>
            <div class="action">
                <a class="new_btn ok" @click="close"><span>确定</span></a>
            </div>
        </div>
    </div>

</template>


<script>
export default {
  name: 'InfoDialog',
  props:['moduleName', 'moduleplay'],
  methods:{
    //打开弹窗
    open:function(e){
        this.show = true;
    },
    //关闭弹窗
    close:function(e){
      this.show = false;
    }
  },
  //程序加载完闭时
  mounted:function() {
  },
  data () {
    return {
        show:false,


    }
  },
    created:function(){


    },
}
</script>
<style scope>
    /* .publicDialog { display: block !important; } */
    .playtext{padding: 0.1rem 0.2rem}
    .playtext p{ text-align: left;}
</style>
